import React from "react";

export const Characteristics = () => {
  return (
    <div className="characteristics">
      <h1>Технічні характеристики моделі Glock 17</h1>
      <p>ТТХ першого серійника glock:</p>
      <ol>
        <li>Тип: самозарядний;</li>
        <li>Калібр - 9 × 19 мм Парабелум;</li>
        <li>Довжина стовбура - 114 мм;</li>
        <li>Загальна довжина - 186 мм;</li>
        <li>Вага без обойми - 0.625 кг;</li>
        <li>Вага разом з повним магазином - 0.905 кг;</li>
        <li>Стандартна кількість патронів -17, однак можна збільшити до 33;</li>
        <li>Початкова швидкість кулі - 375 метрів в секунду;</li>
        <li>Максимальна прицільна дальність - 50 метрів.</li>
      </ol>

      <div className="characteristics_new-pic-4" />
      <div className="capture">Спецназівець з Glock 21</div>

      <h2>Використовувані боєприпаси</h2>
      <p>
        Глок 17 використовує патрон 9 × 19 мм Парабелум, що був розроблений ще в
        1902 році австрійським зброярем, легендарним Георгом Люгером, який
        застосував снаряд в своєму однойменному пістолеті. Після того як в 1904
        році патрон взяли на озброєння в німецькому флоті, він до цих пір
        залишається актуальним. На даний момент цікавий він не тільки блоку
        НАТО, а й Російської Федерації, зброярі якої модифікують Парабелум.
      </p>

      <div className="characteristics_bullet-picture" />
      <div className="capture"> Боєприпаси</div>
      <p>
        За своєю будовою боєприпас - це укорочена гільза від 7.65 × 21 мм
        Парабелум. Так що вона має форми не пляшкового типу, а циліндра. Енергії
        кулі вистачає для того, щоб завдати людині серйозну травму, але не вбити
        його. Тому Глок використовують поліцейські і спецслужби, які повинні
        зупинити злочинця і не довести справу до летального результату.
        Звичайно, патрона не вистачить для того, щоб пробити бронежилет, однак,
        отримана ударна хвиля цілком може збити людину з ніг.
      </p>

      <div className="characteristics_with-weapon" />
      <div className="capture">Терорист з пістолетом Glock 34</div>
    </div>
  );
};
