import React from "react";
import glockFireImg from "../images/my-gif.gif";

export const Construction = () => {
  return (
    <div className="construction">
      <h1>Конструкція</h1>
      <p>
        Конструктивно Глок мав кілька нововведень, які в підсумку зробили його
        одним з найпопулярніших пістолетів у світі. Перш за все, автоматика, яка
        закладена ще в першій моделі, практично ніколи не змінювалася, і всі
        варіації, це лише збільшення магазину, калібру і довжини стовбура. Є
        лише один виняток - модель під індексом 18 - вона здатна стріляти зі
        швидкістю до 1100 пострілів в хвилину, тому були змінені внутрішні
        частини зразка.
      </p>
      <img src={glockFireImg} alt="Вистріл з Glock 17" />
      <div className="capture">Вистріл з Glock 17</div>
      <p>
        Крім того, оригінальна конструкція автоматичного запобіжника: він,
        будучи об'єднаним із спусковим гачком, знімається тільки при одночасному
        натисканні двох компонентів конструкції. Кнопка для екстракції обойми
        розташована на лівій стороні пістолета, трохи нижче пусковий скоби.
        Незважаючи на великий обсяг магазину (в деяких модифікаціях, в таких як
        glock 20 -13 патронів), вага все одно залишається одним з найменших в
        світі. Спускову скобу спеціально збільшили для того, щоб можна було
        вести стрільбу з двох рук.
      </p>

      <div className="construction_picture-modified" />
      <div className="capture">Стрільба з модифікованого пістолета Glock</div>

      <h2>Принцип роботи</h2>
      <p>
        Вся суть роботи автоматики пістолета полягає в віддачі стовбура з
        коротким ходом. Конструктори вирішили застосувати перевірену, але кілька
        модернізовану схему Кольт-Браунінг. Суть роботи цієї системи полягає в
        наступному: під казенною частиною стовбура створюється приплив з похилою
        проточкою, він збігається з напрямних виступом рамки. Австрійські
        конструктори зробили проточку під необхідним кутом, який змушує
        знижуватися рушійний стовбур і той виходить із зачеплення з
        затвором-кожухом. Після чого зупиняється, в результаті цього затвор
        відкочується назад.
      </p>
      <p>
        Доповнення до пістолета На даний момент є два основних доповнення до
        Глок 17. Перше - це прицільне пристосування, що виготовляється з
        високоміцного пластика і встановлюється в спеціальних поперечних пазах,
        які нам відомі як «ластівчин хвіст». Щоб вести вогонь при слабкому
        освітленні, на мушку конструктори завдали світилася, а на цілик прицілу
        світиться рамку. Починаючи з 1988 року, на glock почали встановлювати і
        спеціальний направляючий елемент, на який кріпиться тактичний ліхтар або
        ж покажчик лазерного типу.
      </p>
      <div className="construction_picture-laser" />
      <div className="capture">
        Glock 34 c лазерним покажчиком - одна з кращих модифікацій даного
        пістолета
      </div>
    </div>
  );
};
