import React from "react";
import frontImg from "../images/glock-front-color.gif";

export const Main = () => {
  return (
    <div className="main">
      <h1>Головна</h1>
      <p>
        Людство завжди тяжіло до компактного, але потужного варіанту особистої
        зброї, яким, власне, і став пістолет glock 17, створений однойменної
        австрійською фірмою. Однак легендарним його зробило активну участь в
        голлівудських проектах, що і позначилося на продажах зброї по всьому
        світу. Різні модифікації до сих пір використовуються поліцією і
        спецслужбами країн, що входять в НАТО.
      </p>
      <img src={frontImg} alt="glock gif" />
      <div className="capture">Glock 17</div>
      <p>
        Сьогодні ми поговоримо про родоначальник цієї лінійки, моделі під
        індексом 17, яка включала в себе всього 34 деталі, тому натренований
        боєць без всяких зусиль міг розібрати його менше, ніж за одну хвилину.
        Зброя відрізняється невеликими розмірами, легким вагою, а також
        практичністю, бо має можливість вести вогонь під водою.
      </p>
      <div className="main_picture" />
      <div className="capture">
        Зовнішній вигляд класичного варіанту пістолета Glock під індексом 17
      </div>
    </div>
  );
};
