import React from "react";

export const Models = () => {
  return (
    <div className="models">
      <h1>Моделі пістолету Glock</h1>
      <p>
        На даний момент лінійка розрослася до величезних розмірів, але ми
        перерахуємо лише основні моделі:
      </p>
      <ol>
        <li>
          17L - найперша модифікація основного пістолета, єдина відмінність
          якого в подовженому стволі. Була створена в 1988 році;
        </li>
        <li>18 - спеціалізований варіант для ведення вогню чергами;</li>
        <li>
          19 - більш компактна модель. Має укорочений стовбур 102 мм (початкова
          версія - 114 мм). До 1990 року у цієї модифікації була приписка
          Compact, від якої в підсумку відмовилися;
        </li>

        <li>
          20 - цей зразок відрізняється тим, що створений спеціально для патрона
          10 мм Auto, а також має збільшений магазин і вбудований компенсатор;
        </li>
        <li>
          21 - нерідко думають, що це спеціальна модель Глока для 45 калібру,
          однак, патрон .45 ACP, всупереч своїй назві, має калібр 11.51 мм.
          Обойма збільшена до 15 зарядів;
        </li>
        <li>
          22 - модель, яку спеціально створювали для того, щоб її
          використовували в ФБР. Даний варіант створювався під калібр .40 S & W.
          Створена ще в 1990 році, модель досі залишається актуальною, і на
          даний момент немає новин, що будуть міняти табельну зброю в
          держструктурі США;
        </li>
        <li>
          34 - одна з найкращих модифікацій, яка має подовжений ствол, має
          підвищену щільністю стрільби. По суті, ця модель створювалася в
          Австрії спеціально для того, щоб піти на експорт. І зараз нею
          озброюють поліцію США, практично у всіх її структурах, а також в Чилі
          і Малайзії;
        </li>
        <li>
          39 - передостанній зразок Glock, який є укороченою і зменшеною його
          модифікацією. В цілому зараз є тенденція створити з Глока, який і так
          маленький пістолет, якесь «дамське зброю» абсолютно мініатюрного виду.
        </li>
      </ol>

      <div className="models_fron-pic" />
      <div className="capture">Людина цілиться з пістолетом Glock 22</div>
    </div>
  );
};
